#include <iostream>
using namespace std;

char FORMAT[] = "%s %s, %d \n"; //форматування згідно очікуваного виводу
char DESIGN[] = "Design by"; //початок
char AUTHOR[] = "Khrystyna Kolba";//автор
int YEAR = 2022;//рік (спеціально записаний як інт, для різноманітності)

int main() {
	__asm {
		// початок асемблерного коду
		mov eax, YEAR //переміщення YEAR до регістру eax
		push eax //заштовхування YEAR в стек
		mov eax, offset AUTHOR //переміщення відносної адреси AUTHOR до регістру eax
		push eax //заштовхування AUTHOR в стек
		mov eax, offset DESIGN //переміщення відносної адреси DESIGN до регістру eax
		push eax //заштовхування DESIGN в стек
		mov eax, offset FORMAT //переміщення відносної адреси FORMAT до регістру eax
		push eax //заштовхування FORMAT в стек

		call printf //визначається під час виконання програми 
		//виклик функції для виводу, яка приймає як параметри формат, і список
		//аргументів (порядок згідно правил роботи стеку, саме тому формат заштовхували в стек останнім, 
		//а рік першим)

		
		// Очищення стеку для коректного завершення процедури main(4 рази заштовхували, отже
		//4 рази очищуєм) копіює значення зі стеку в регістр ebx і очищує стек
		pop ebx
		pop ebx
		pop ebx
		pop ebx
	} // кінець асемблерного коду

	return 0;
}