#include <iostream>
using namespace std;
int main() {
	int year, leap;
	cin >> year;
	__asm {
		mov ebx, 0  //записуємо в регістр ebx 0
		mov ecx, 400 //записуємо в регістр eсx 400
		mov eax, year // записуємо в регістр eаx рік, який ми ввели в консоль
		cdq //розширюємо регістр еах

		div ecx //ділимо вмістиме регітру еах на вмістиме регістру есх (year/400)
		// результат записуємо в еах, остачу в edx

		test edx, edx //порівнюємо edx(тобто остачу) з нулем 
		//(zf буде 1 якщо остача дорівнює 0)
		jz is_leap  //якщо остача 0, то перестрибує до is_leap

		//якщо остача не 0, то перевіряємо далі
		//(ще є шанс що рік високосний, якщо ділиться на 4, але не на 100)
		mov eax, year // записуємо в регістр eаx рік, який ми ввели в консоль
		//(бо там був вже результат ділення)

		cdq //розширюємо регістр еах

		mov ecx, 4 //записуємо в регістр eсx 4

		div ecx //ділимо вмістиме регітру еах на вмістиме регістру есх (year/400)
		// результат записуємо в еах, остачу в edx

		test edx, edx //порівнюємо edx(тобто остачу) з нулем 
		//(zf буде 1 якщо остача дорівнює 0)

		jz maybe_leap //якщо остача 0, то перестрибує до maybe_leap
		jmp result //якщо остача не 0, то перестрибує до result(не високосний)

		is_leap : //потрапляємо сюди, якщо точно знаємо, що рік високосний
		    mov ebx, 1 //в регістр ebx записуємо 1 
			jmp result //перестрибуємо до result

	    maybe_leap : //потрапляємо сюди, якщо рік не ділиться на 400, але ділиться на 4
		    mov eax, year // записуємо в регістр eаx рік, який ми ввели в консоль
		//(бо там був вже результат ділення)

			cdq //розширюємо регістр еах

			mov ecx, 100 //записуємо в регістр eсx 100

			div ecx //ділимо вмістиме регітру еах на вмістиме регістру есх (year/400)
		// результат записуємо в еах, остачу в edx

			test edx, edx //порівнюємо edx(тобто остачу) з нулем 
		//(zf буде 1 якщо остача дорівнює 0)
			jz result //якщо остача 0, то перестрибує до result (не високосний)
			jmp is_leap//якщо остача не 0, то не ділиться на 100, а значить високосний
				//(ділиться на 4)

		result : //потрапляємо сюди в кінці програми 
		    mov leap, ebx //поміщаємо в змінну leap значення ebx, яке ми отримали
				//це наш результат
	}
	if (leap > 0) {
		cout << "Yes" << endl;
	}
	else {
		cout << "No" << endl;
	}
	return 0;
}