#include <iostream>
using namespace std;
int main() {
	//__int32 arr = 848843586; // (0011 0010 1001 1000
	                          // 0101 0011 0100 0010)
	__int32 arr = 568579807; //0010 0001 1110 0011 1101 0110 1101 1111
	//__int32 arr = 0;
	__int32 res=0;
	__asm{
		mov cx, 8 // к≥льк≥сть проход≥в циклу
		mov eax, 1 // маска //0000 0000 0000 0000 0000 0000 0000 0001
	start_outer: // початок зовн≥шнього циклу (по словах)
		mov bx, 4 // к≥льк≥сть проход≥в внутр≥шнього циклу 
		xor di, di // обнуленн€ л≥чильника одиниц
	start_inner:// початок внутр≥шного циклу (по б≥тах)
		mov edx, arr
		and edx, eax // накладанн€ маски
		jz go_next// €кщо результат Ч 0
		inc di// €кщо результат Ч 1, зб≥льшуЇмо л≥чильник
	go_next:
		shl eax, 1// поб≥товий зсув вл≥во на 1 б≥т
		dec bx// зменшуЇмо л≥чильник проход≥в на 1
		test bx, bx// перев≥р€Їмо умову завершенн€ циклу
		jnz start_inner// повторюЇмо цикл, €кщо результат не 0
		test di, di //пор≥вн€нн€ з нулем
		jz end_
		and di, 1// перев≥рка на парн≥сть
		jnz end_// €кщо непарне
		inc res// €кщо парне, зб≥льшуЇмо л≥чильник
	end_:
		loop start_outer// зак≥нченн€ зовн≥шнього циклу
	}
	cout << res << endl;
}